In [21]:
#Dataframes: Modificación de los nombres de las filas
import pandas as pd

In [31]:
rows = "ventas1 ventas2 ventas3".split()
columns = "zonaA zonaB zonaC".split()
data = [[120,312,190], [190, 289, 901], [179, 129, 400]]
dataframe = pd.DataFrame(data, rows, columns)

In [32]:
dataframe

         zonaA  zonaB  zonaC
ventas1    120    312    190
ventas2    190    289    901
ventas3    179    129    400

In [33]:
new_rows = "dia1 dia2 dia3".split()
new_rows

['dia1', 'dia2', 'dia3']

In [34]:
dataframe["dias"] = new_rows
dataframe

         zonaA  zonaB  zonaC  dias
ventas1    120    312    190  dia1
ventas2    190    289    901  dia2
ventas3    179    129    400  dia3

In [35]:
dataframe = dataframe.set_index('dias') #Setiar las nombres de las filas con los días

In [37]:
dataframe

      zonaA  zonaB  zonaC
dias
dia1    120    312    190
dia2    190    289    901
dia3    179    129    400